<?php

$lang['isf_succ_cd'] = 'S100';
$lang['isf_svc_err_cd'] = 'E400';

$lang['S100'] = '성공적으로 수행 되었습니다.';

$lang['E200'] = 'API 버전이 맞지 않습니다.';
$lang['E300'] = 'Request 처리 중 오류가 발생했습니다.';
$lang['E301'] = 'Request 데이터 형식 오류가 발생했습니다. 받은 내용 : ()';
$lang['E302'] = 'Request에서 () 파라미터는 필수 값입니다.';
$lang['E303'] = 'Request에서 () 파라미터의 포맷이 맞지 않습니다.';
$lang['E500'] = '내부 시스템에서 예기치 않은 오류가 발생했습니다.';

$lang['M003_01'] = '매체로 광고가 예약되어 있어서 삭제가 불가합니다.';
$lang['M004_01'] = 'start_dt는 월요일이어야 합니다.';
$lang['M004_02'] = '해당 start_dt는 이미 존재합니다.';
$lang['M004_03'] = 'start_dt 이후로 광고가 걸려 있습니다.';
$lang['M004_04'] = '다른 요청이 처리중입니다.';

$lang['T001_01'] = '다른 요청이 처리중입니다';
$lang['T002_01'] = '해당 광고에 대한 예약을 진행할 수 없습니다.';
$lang['T002_02'] = '해당 광고는 freezing 상태입니다.';
$lang['T002_03'] = '다른 요청이 처리중입니다';
$lang['T002_04'] = '요청한 건수보다 적은 모수가 존재합니다.';
$lang['T003_01'] = '해당 광고 파일이 존재하지 않습니다.';
$lang['T004_01'] = '현재는 광고를 취소할 수 없습니다.';
$lang['T004_02'] = '이미 지난 광고로 취소할 수 없습니다.';
$lang['T004_03'] = '다른 요청이 처리중입니다.';

/* End of file isf_lang.php */
/* Location: ./system/language/korea/isf_lang.php */